/* 왕관 아이콘 컴포넌트 */
import React from 'react';

// 기본값 정의
const defaultProps = {
    width: 10,
    height: 10,
    iconColor: '#FFBF00',
};

const CrownIcon = ({
    width = defaultProps.width,
    height = defaultProps.height,
    iconColor = defaultProps.iconColor,
    ...rest 
}) => (
    <svg 
        xmlns="http://www.w3.org/2000/svg" 
        width={width}         // Prop으로 설정
        height={height}       // Prop으로 설정
        viewBox="0 0 10 10"    // viewBox 고정 
        fill="none"
        {...rest} 
    >
        {/* path의 fill을 iconColor prop으로 설정 */}
        <path 
            d="M1.3802 8.84014H8.6202C8.7402 8.84014 8.8402 8.74014 8.8402 8.62014V8.08014H1.1602V8.62014C1.1602 8.76014 1.2602 8.84014 1.3802 8.84014ZM9.2002 2.44014C8.8602 2.44014 8.6002 2.70014 8.6002 3.04014C8.6002 3.20014 8.6602 3.36014 8.7802 3.46014L6.9802 5.30014L5.2802 2.26014C5.4602 2.16014 5.5802 1.96014 5.5802 1.74014C5.5802 1.40014 5.3202 1.14014 4.9802 1.14014C4.6402 1.14014 4.3802 1.40014 4.3802 1.74014C4.3802 1.96014 4.5002 2.16014 4.6802 2.26014L2.9802 5.30014L1.1802 3.46014C1.3402 3.36014 1.4002 3.20014 1.4002 3.04014C1.4002 2.70014 1.1402 2.44014 0.800195 2.44014C0.460195 2.44014 0.200195 2.70014 0.200195 3.04014C0.200195 3.38014 0.460195 3.64014 0.800195 3.64014C0.820195 3.64014 0.840195 3.64014 0.840195 3.64014L1.1602 7.72014H8.8402L9.1602 3.64014C9.18019 3.64014 9.2002 3.64014 9.2002 3.64014C9.5402 3.64014 9.8002 3.38014 9.8002 3.04014C9.8002 2.72014 9.5402 2.44014 9.2002 2.44014Z" 
            fill={iconColor} // 동적 색상
        />
    </svg>
);

CrownIcon.displayName = 'CrownIcon'; // 컴포넌트 이름 

export default CrownIcon;